# Indexing & Selection & Filtering in Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
obj=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])

In [4]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [5]:
obj["c"]

2

In [6]:
obj[2]

2

In [7]:
obj[0:3]

a    0
b    1
c    2
dtype: int32

In [8]:
obj[["a","c"]]

a    0
c    2
dtype: int32

In [9]:
obj[[0,2]]

a    0
c    2
dtype: int32

In [10]:
obj[obj<2]

a    0
b    1
dtype: int32

In [11]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int32

In [12]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int32

## DataFrame Indexing

In [13]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [14]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int32

In [15]:
data[["one","two"]]

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [16]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [19]:
data[data["one"]>5]

          one  two  three  four
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [20]:
data[data<5]=0
data

          one  two  three  four
London      0    0      0     0
Paris       0    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [26]:
data.loc[["Paris","Berlin"], ["two","three"]]

        two  three
Paris     5      6
Berlin    9     10

## Selecting with iloc and loc

In [24]:
data.iloc[1]

one      0
two      5
three    6
four     7
Name: Paris, dtype: int32

In [25]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int32

In [23]:
data.iloc[[1,3],1:]

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [21]:
data.loc["Paris",["one","two"]]

one    0
two    5
Name: Paris, dtype: int32

In [24]:
data.loc[:"Paris","four"]

London    0
Paris     7
Name: four, dtype: int32

In [27]:
toy_data=pd.Series(np.arange(5),
                   index=["a","b","c",
                          "d","e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [28]:
toy_data[-1]

4